In [2]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [59]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released each decade in the history of cinema.

In [4]:
titles['title'].groupby((titles['year']//10)*10).count()

year
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
Name: title, dtype: int64

### Use groupby() count the number of "Hamlet" films made each decade.

In [5]:
filter_hamlet = titles['title'] == 'Hamlet'
titles[filter_hamlet]['title'].groupby((titles['year']//10)*10).count()

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
Name: title, dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [48]:
filters = (cast['n'] == 1) & (cast['year'].between(1950,1959))
cast[filters][['year','type']].groupby(['year','type']).size()

year  type
1950  actor      626
      actress    281
1951  actor      647
      actress    281
1952  actor      607
      actress    293
1953  actor      652
      actress    301
1954  actor      634
      actress    310
1955  actor      641
      actress    281
1956  actor      643
      actress    305
1957  actor      735
      actress    301
1958  actor      710
      actress    295
1959  actor      721
      actress    317
dtype: int64

### In the 1950s decade taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [52]:
filters = (cast['n'].between(1,5)) & (cast['year'].between(1950,1959))
cast[filters][['n','type']].groupby(['n','type']).size()

n    type
1.0  actor      6616
     actress    2965
2.0  actor      4564
     actress    4556
3.0  actor      5587
     actress    3148
4.0  actor      5594
     actress    2849
5.0  actor      5611
     actress    2544
dtype: int64

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [72]:
filter_panther = (cast['title'] == 'The Pink Panther')
cast[filter_panther][['year','type']].groupby('year').count() #[['year','type']]

      type
year
1963    21
2006    90

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [91]:
filter_oz = (cast['name'] == 'Frank Oz')
x = cast[filter_oz][['year','title']].groupby('title').size()
x[x>1]

title
An American Werewolf in London          2
Follow That Bird                        3
Muppet Treasure Island                  4
Muppets from Space                      4
The Adventures of Elmo in Grouchland    3
The Dark Crystal                        2
The Great Muppet Caper                  6
The Muppet Christmas Carol              7
The Muppet Movie                        8
The Muppets Take Manhattan              7
dtype: int64

### List each of the characters that Frank Oz has portrayed at least twice.

In [99]:
x = cast[filter_oz]['character'].value_counts()
x[x>1]

Yoda              6
Miss Piggy        6
Animal            6
Sam the Eagle     5
Fozzie Bear       4
Cookie Monster    3
Bert              3
Grover            2
Name: character, dtype: int64